{
    "projects" : {
        "one": {
            "name": "Cinco.",
            "description" : "Este es un pequeño proyecto basado en en aquellos juegos creados en flash que eran populares en paginas como mini juegos, en especial los juegos como Submachine creados por  <a href=\"http://www.mateuszskutnik.com/\" target=\"_blank\" style=\"font-weight: bold;\">Mateusz Skutnik</a> los cuales eran mis favoritos juegos del genero point-and-click. En este caso he creado un juego corto point-and-click con un motor llamado <a href=\"https://godotengine.org/\" target=\"_blank\" style=\"font-weight: bold;\">Godot</a> un proyecto de código abierto muy flexible y relativamente fácil de aprender ya que tiene su propio lenguaje de programación llamado GDscript muy similar a Python. Este es mi primer juego pero espero seguir desarrollando mucho mas y aprender sobre otros motores que he estado indagando como unity y unreal. No soy muy fan de lo videojuegos pero si me impresiona mucho todo lo que se puede lograr con ellos y me da mucha curiosidad saber como se hacen ya que abarcan bastantes areas que me parecen muy interesantes.<br><br> Puedes probar mi juego en <a href=\"https://andresleonardo.itch.io/cinco\" target=\"_blank\" style=\"font-weight: bold;\">itch</a> o en <a href=\"https://gotm.io/andreleonardo/cinco\" target=\"_blank\" style=\"font-weight: bold;\">gotm</a>.",
            "image" : ["src/assets/images/game.png"],
            "slug" : "cinco-videojuego"
        },
        "two": {
            "name" : "Edición de imagenes.",
            "description" : "Cuando comencé a aprender a programar se me complicaba mucho encontrar un lenguaje con el cual me sintiera a gusto para poder practicar y aprender fluidamente hasta que encontré un programa llamado <a href=\"https://processing.org/\" target=\"_blank\" style=\"font-weight: bold;\">Processing</a></a> creado por  <a href=\"https://benfry.com/\" target=\"_blank\" style=\"font-weight: bold;\">Ben Fry</a> y  <a href=\"http://www.reas.com/\" target=\"_blank\" style=\"font-weight: bold;\">Casey Reas</a>, un diseñador y un artista. <a href=\"https://processing.org/\" target=\"_blank\" style=\"font-weight: bold;\">Processing</a> es un entorno de programación con un lenguaje abreviado basado en java que te da bastante funciones para crear objetos 2d o 3d de una manera bastante rápida y muchas otras funciones para demasiadas cosas, por lo cual puedes aprender programación de una manera mas didáctica ya que el propósito del proyecto fue crear un entorno para principiantes y artistas, un principiante como yo con un hobbie el cual es tomar fotos así que a medida que conocía su comunidad y veía sus increíbles proyectos empece a estudiar su documentación y ver los tutoriales relacionados a <a href=\"https://processing.org/\" target=\"_blank\" style=\"font-weight: bold;\">Processing</a> y mezcle mi hobbie con la programación, empece a editar mis fotos con <a href=\"https://processing.org/\" target=\"_blank\" style=\"font-weight: bold;\">Processing</a>. Ya ha día de hoy ya no uso constantemente <a href=\"https://processing.org/\" target=\"_blank\" style=\"font-weight: bold;\">Processing</a> pero uso una biblioteca de javascript creada por la misma fundación para poder estar mas al día con los lenguajes mas actuales llamada  <a href=\"https://p5js.org/es/\" target=\"_blank\" style=\"font-weight: bold;\">P5js</a> el cual es una biblioteca muy activa que se encuentra en constante crecimiento y de donde han surgido otras bibliotecas. Asi que este es mi forma de mezclar la programación con cosas que me gusta realizar en mi tiempo libre.",
            "image" : ["src/assets/images/portrait.jpg", "src/assets/images/portrait2.png","src/assets/images/portrait3.png","src/assets/images/portrait4.png","src/assets/images/portrait5.png","src/assets/images/portrait6.png","src/assets/images/portrait7.png"],
            "slug" : "edicion-de-imagenes"
        },
        "three": {
            "name" : "Go-do.",
            "description" : "Se trata de un plugin para el motor de videojuegos godot engine en el cual quiero realizar una herramienta para crear mapas mentales y a su vez se cree un panel lateral de manera automatica donde se listen los nodos y pueda clasificarlos por prioridad a cada uno.<br><br>Lo empece a realizar ya que para mi es mucho mas comodo trabajar de esta manera, asi puedo desglosar un proyecto hasta su problemas mas pequeños y a su vez estare realizando una herramienta totalmente personalizable para mi. Puedes ver y descargar el proyecto si te interesa en mi perfil de <a href=\"https://github.com/andresleonardobg/go-do\" target=\"_blank\" style=\"font-weight: bold;\">github.</a><br><br>(Aún se encuentra en desarrollo.)",
            "image" : ["src/assets/images/go-do.gif"],
            "slug" : "go-do"
        }
    }
}